In [7]:
import pandas as pd
import matplotlib.pyplot as plt

In [8]:
data_hist = {
    'Name': ['Mohan', 'Andrea', 'Sofia', 'Joe', 'Virat', 'Abdul'],
    'Score': [75, 72, 68, 65, 67, 73]
}

In [9]:
df = pd.DataFrame(data_hist)

In [10]:
df

     Name  Score
0   Mohan     75
1  Andrea     72
2   Sofia     68
3     Joe     65
4   Virat     67
5   Abdul     73

In [11]:
df['Score'].describe()

count     6.000000
mean     70.000000
std       3.898718
min      65.000000
25%      67.250000
50%      70.000000
75%      72.750000
max      75.000000
Name: Score, dtype: float64

In [12]:
data_math = {
    'Name': ['Mohan', 'Andrea', 'Sofia', 'Joe', 'Virat', 'Abdul'],
    'Score': [93, 96, 43, 47, 51, 90]
}

In [14]:
df_math = pd.DataFrame(data_math)

In [15]:
df_math.describe()

           Score
count   6.000000
mean   70.000000
std    25.392912
min    43.000000
25%    48.000000
50%    70.500000
75%    92.250000
max    96.000000

- Mean Absolute Deviation (L1)
- Standard Deviation (L2)

  - L1/MAD: Good for non-normal/skewed data.

  - L2/std: Common for normal distributions.